backend/app/models/drink.rb

SELECT COUNT(*) FROM "instructions" WHERE "instructions"."drink_id" = ?  [["drink_id", 1]]
---
  def set_instruction_count
    self.instruction_count = instructions.length

SELECT COUNT(*) FROM "ingredients" WHERE "ingredients"."drink_id" = ?  [["drink_id", 1]]
---
  def set_ingredient_count
    self.ingredient_count = ingredients.length