backend/app/models/drink.rb

  def generate_slug
    base_slug = name.to_s.gsub(/['`]/, '').parameterize
    slug_candidate = base_slug
    count = 2
    while Drink.exists?(slug: slug_candidate)
---
SELECT 1 AS one FROM "drinks" WHERE "drinks"."slug" = ? LIMIT ?  [["slug", "toronto"], ["LIMIT", 1]]