backend/app/serializers/drink_serializer.rb

  def ingredients
    object.ingredients.map do |ingredient|
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."drink_id" = ?  [["drink_id", 1]]

  def instructions
    object.instructions.map do |instruction|
---
SELECT "instructions".* FROM "instructions" WHERE "instructions"."drink_id" = ?  [["drink_id", 1]]