backend/app/controllers/api/v1/auth_controller.rb

  def create
    puts user_login_params
    @user = User.find_by(username: user_login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "simpleuser"], ["LIMIT", 1]]