backend/app/controllers/api/v1/drinks_controller.rb

  def index
    drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"

  def create
    drink = Drink.create(drink_params)
---
INSERT INTO "drinks" ("name", "description", "ingredient_count", "instruction_count", "glass", "garnish", "image", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    drink = Drink.find_by(params[:slug])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."slug" = ? LIMIT ?  [["slug", "toronto"], ["LIMIT", 1]]