backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "bio", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.create(user_params)